#pragma once
#include "stdafx.h"
#include "raw_data_warappers.h"
/*!
 * \file protocol_structures.h
 *
 * \author Victor Mulika
 * \date 01 Март 2015
 *
 * Структуры для обмена данными с сервером
 */

namespace server_exchange
{
// результат преобразования данных
enum class e_convert_result
{
	invalid_data,	// неверные данные
	success,		// успех
	empty_data		// пустой блок данных
};

// начало пакета
const uint16_t begin_byte = 0xf00d;

// конец пакета
const uint16_t end_byte = 0x1013;

// тип пакета
enum class e_packet_type : byte
{
	unknown = 0,	// неизвестно
	id = 1			// пакет идентификации терминала
};

/******************************************************************************************
Структура транспортного пакета
-------------------------------------------------------------------------------------
Название						|	Длина	|	Тип		|	Фиксированное значение	|
-------------------------------------------------------------------------------------
Начало пакета					|	2		|	USHORT	|			0xF00D			|
Тип пакета						|	1		|	BYTE	|							|
Длина данных					|	2		|	USHORT	|							|
Данные							|1...65536	| 	ARRAY	|							|
Окончание пакета				|	2		|	USHORT	|			0x1013			|
-------------------------------------------------------------------------------------
******************************************************************************************/
// транспортный пакет, в котором передаются данные
struct tag_transport_packet 
{
	uint16_t								begin;		// начальные байты 0x0d и 0xf0
	e_packet_type							type;		// тип пакета
	uint16_t								length;		// длина данных (без учёта последних байт)
	tools::data_wrappers::_tag_data_managed	data;		// даннные
	uint16_t								end;		// окончание пакета

	tag_transport_packet()
		: begin (begin_byte)
		, type (e_packet_type::unknown)
		, length (0)
		, end (end_byte)
	{

	}
};


/******************************************************************************************
Структура пакета идентификации
-------------------------------------------------------------------------------------
Название						|	Длина	|	Тип		|	Фиксированное значение	|
-------------------------------------------------------------------------------------
Название группы					|	20		|CHAR ARRAY	|							|
Название терминала				|	20		|CHAR ARRAY	|							|
-------------------------------------------------------------------------------------
******************************************************************************************/

#pragma pack(push, 1)
// пакет идентификации терминала
struct tag_identification_packet
{
	char	group_name[20];		// название группы терминалов
	char	terminal_name[20];	// название терминала
};
#pragma pack(pop)


}



